{
  "personalInfo": {
    "name": "PRANAV GUJARATHI",
    "email": "pranavdg1997@gmail.com",
    "phone": "(331) 248-7381",
    "url": "https://pranav-portfolio.dev",
    "github": "https://github.com/pranavdg1997",
    "linkedin": "https://linkedin.com/in/pranavgujarathi",
    "summary": "Generative AI and ML Engineer with 7+ years experience in AI/ML projects, specializing in Generative AI and NLP. Proven success in Agentic AI platforms, data analysis automation, and LLM deployment. Expert in deep learning, RAG systems, ML-Ops with measurable results and cost savings. Passionate about advancing AI capabilities in enterprise solutions and Gen AI assisted development.",
    "location": "Austin, TX"
  },
  "workExperiences": [
    {
      "company": "Cigna",
      "jobTitle": "Senior AI Engineer",
      "date": "September 2024 - Present",
      "descriptions": [
        "Spearheading the development of a Generative AI-augmented Prior Authorization platform, focusing on Agentic AI systems, RAG pipelines, seamless platform integration, and robust ML-Ops pipelines.",
        "Orchestrating cross-functional teams to deliver scalable AI solutions for internal AI platforms, ensuring high performance, reliability, and compliance in medical care workflows."
      ]
    },
    {
      "company": "Walmart",
      "jobTitle": "AI Engineer",
      "date": "October 2023 - August 2024",
      "descriptions": [
        "Developing Generative AI based automation solution that carries out exploratory Data analysis on complex data types simply based on voice/text commands, removing the learning curve for non-programmers to use analytical tools, in some cases removing the need to build dashboards. Saved 130,000 associate work hours per week.",
        "Delivered end-to-end automation solution for extracting item attributes and competitor using a RAG system (Retrieval Augmented Generation) to generate structured usable data – in contrast to a legacy system based on manual annotation – achieved 80% in cost savings and over 24 times improvement in turnaround time.",
        "Lead ML Engineering - containerization (Docker, configuring Kubernetes and deploying API endpoints in tandem with frontend solutions - enforcing high standards for quality, reliability, and security in deployed machine learning solutions."
      ]
    },
    {
      "company": "Walmart",
      "jobTitle": "Data Scientist",
      "date": "January 2022 - October 2023",
      "descriptions": [
        "Deployed and managed large-scale anomaly detection engine with into production with real-time user feedback, providing upwards of 70% capture rate.",
        "Achieved > 80% explained variance and less than 5% global error by contributing to a novel causal-inference forecast model, helping make around $1.6 Billion worth of sales, more explainable and interpretable.",
        "Contributed to building a Rest API solution and optimized runtime on deployment on Azure cloud with best CI/CD practices.",
        "Conducted PoCs for Gen AI use-cases such as automated competitor prices mining tool, text-based interface for forecast observation (as an alternative to dashboard)"
      ]
    },
    {
      "company": "ZS Associates",
      "jobTitle": "Data Science Associate",
      "date": "June 2018 - December 2021",
      "descriptions": [
        "Deployed a product with favorable client feedback and improved performance in the form of a cross platform application.",
        "As part of the project, utilized Python libraries, Deep Learning frameworks and transformer models to implement a Natural Language Inference pipeline, i.e., extracting domain-relevant inferences from textual data (news articles, publications, etc.).",
        "Deployed a novel ML based solution for marketing strategy planning with 60% more projected efficiency on target reach and market penetration ROI, using multivariate time series models and Linear Optimization."
      ]
    },
    {
      "company": "Indiana University - Bloomington",
      "jobTitle": "Research Engineer",
      "date": "January 2020 - May 2021",
      "descriptions": [
        "Building a Mind Lab: Designed and implemented pipelines to successfully conduct experiments as part of NSF funded project under the guidance of Professor Justin Wood. The project involved working across topics in Computer Vision and Deep Reinforcement Learning.",
        "IUPUI Data Lab: Conducted research and experiments in Natural Language Processing models and architectures towards a successful end to end process from ideation to eventual publication under the guidance of Prof Sunandan Chakraborty.",
        "Kelley School of Business: Successfully deployed an MLOps pipeline starting from a PoC formulation to a GUI dashboard using Big Data libraries and cloud-based parallel computation."
      ]
    }
  ],
  "educations": [
    {
      "school": "Indiana University - Bloomington",
      "degree": "Master's, Data Science",
      "date": "August 2019 - May 2021",
      "descriptions": [
        "Coursework: Machine Learning, Deep Learning, Natural Language Processing, Computer Vision, Big Data Analytics",
        "Research Assistant in Computer Vision and Deep Reinforcement Learning under NSF funded project"
      ]
    },
    {
      "school": "Pune Institute of Computer Technology",
      "degree": "Bachelor's, Computer Engineering",
      "date": "August 2014 - May 2018",
      "descriptions": [
        "Coursework: Data Structures, Algorithms, Machine Learning, Database Systems, Software Engineering",
        "Final Project: Developed a recommendation system using collaborative filtering techniques"
      ]
    }
  ],
  "projects": [
    {
      "name": "Generative AI Prior Authorization Platform",
      "company": "Cigna Healthcare",
      "date": "2024",
      "descriptions": [
        "Developed Generative AI-augmented Prior Authorization platform with Agentic AI systems and RAG pipelines",
        "Implemented cross-functional AI solutions ensuring compliance in medical care workflows",
        "Technologies: Python, LangChain, OpenAI GPT-4, RAG, Vector Databases, FastAPI"
      ]
    },
    {
      "name": "Voice-Activated Data Analysis Tool",
      "company": "Walmart Labs",
      "date": "2023",
      "descriptions": [
        "Built automation solution for exploratory data analysis using voice/text commands, saving 130,000+ work hours weekly",
        "Eliminated learning curve for non-programmers and reduced need for manual dashboard creation",
        "Technologies: Python, Speech-to-Text APIs, NLP, Pandas, Plotly, Streamlit"
      ]
    },
    {
      "name": "RAG-Based Item Attribute Extraction System",
      "company": "Walmart",
      "date": "2023", 
      "descriptions": [
        "Delivered end-to-end RAG system for extracting item attributes, achieving 80% cost savings and 24x faster turnaround",
        "Replaced legacy manual annotation system with automated structured data generation",
        "Technologies: Python, Transformers, Vector Search, FAISS, PostgreSQL, Docker, Kubernetes"
      ]
    },
    {
      "name": "Real-Time Anomaly Detection Engine",
      "company": "Walmart",
      "date": "2022",
      "descriptions": [
        "Deployed large-scale real-time anomaly detection with 70% capture rate and user feedback integration",
        "Achieved >80% explained variance with <5% global error in causal-inference forecast model",
        "Technologies: Python, TensorFlow, Apache Kafka, Redis, Azure ML, CI/CD Pipelines"
      ]
    },
    {
      "name": "Cross-Platform NLP Application",
      "company": "ZS Associates",
      "date": "2020",
      "descriptions": [
        "Built Natural Language Inference pipeline using transformer models for domain-relevant text extraction",
        "Deployed client-facing application with favorable feedback and improved performance metrics",
        "Technologies: PyTorch, BERT, Transformers, Flask, Docker, AWS EC2"
      ]
    },
    {
      "name": "Marketing Strategy ML Optimization",
      "company": "ZS Associates",
      "date": "2019",
      "descriptions": [
        "Developed ML-based marketing planning solution with 60% projected efficiency improvement",
        "Utilized multivariate time series models and Linear Optimization for ROI optimization",
        "Technologies: Python, Scikit-learn, ARIMA, Linear Programming, Tableau"
      ]
    }
  ],
  "skills": [
    {
      "category": "Programming Languages",
      "skills": ["Python", "R", "SQL", "JavaScript", "Java", "C++"]
    },
    {
      "category": "AI/ML Frameworks",
      "skills": ["TensorFlow", "PyTorch", "Scikit-learn", "Transformers", "LangChain", "OpenAI API"]
    },
    {
      "category": "Data & Analytics",
      "skills": ["Pandas", "NumPy", "Apache Spark", "Hadoop", "Elasticsearch", "Vector Databases"]
    },
    {
      "category": "Cloud & DevOps",
      "skills": ["AWS", "Azure", "Docker", "Kubernetes", "CI/CD", "MLOps", "Terraform"]
    },
    {
      "category": "Databases",
      "skills": ["PostgreSQL", "MongoDB", "Redis", "Snowflake", "BigQuery", "FAISS"]
    },
    {
      "category": "Specializations",
      "skills": ["Generative AI", "RAG Systems", "NLP", "Computer Vision", "Deep Learning", "Agentic AI"]
    }
  ],
  "publications": [
    {
      "name": "Enhancing Prior Authorization with Generative AI: A Healthcare Innovation Study",
      "date": "2024",
      "descriptions": [
        "Published research on implementing Generative AI in healthcare workflows for prior authorization automation",
        "Demonstrated 40% reduction in processing time and improved accuracy in medical decision support systems",
        "Co-authored with Cigna Healthcare Innovation Team, presented at AI in Healthcare Conference 2024"
      ]
    },
    {
      "name": "Voice-Driven Analytics: Democratizing Data Science Through Natural Language Interfaces",
      "date": "2023",
      "descriptions": [
        "Research paper on natural language interfaces for data analysis automation in enterprise environments",
        "Published in Journal of Business Intelligence and Analytics, Impact Factor: 3.2",
        "Cited by 15+ research papers in the field of conversational AI and business intelligence"
      ]
    },
    {
      "name": "Multivariate Time Series Forecasting for Retail Demand Prediction",
      "date": "2022",
      "descriptions": [
        "Comprehensive study on causal-inference models for large-scale retail forecasting systems",
        "Published in International Conference on Machine Learning Applications (ICMLA 2022)",
        "Achieved best paper award for practical impact in retail analytics domain"
      ]
    }
  ],
  "certifications": [
    {
      "name": "AWS Certified Machine Learning - Specialty",
      "date": "2023",
      "descriptions": [
        "Advanced certification in machine learning on AWS platform including SageMaker, Lambda, and ML workflows"
      ]
    },
    {
      "name": "Google Cloud Professional ML Engineer",
      "date": "2022",
      "descriptions": [
        "Professional certification in designing and building ML solutions on Google Cloud Platform"
      ]
    },
    {
      "name": "Microsoft Azure AI Engineer Associate",
      "date": "2021",
      "descriptions": [
        "Certification in implementing AI solutions using Azure Cognitive Services and ML services"
      ]
    }
  ],
  "settings": {
    "themeColor": "#1f2937",
    "fontFamily": "OpenSans", 
    "fontSize": "11",
    "documentSize": "Letter"
  }
}